app/views/blogs/index.html.erb

SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."created_at" DESC
SELECT COUNT(*) FROM "blogs" WHERE "blogs"."user_id" = $1  [["user_id", 4]]
---
<h1>Blogs</h1>
      <% if current_user.blogs.count ==0 %>