app/views/blogs/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 1]]
---
      </div>
      <% @blog.comments.each do |comment | %>