app/views/comments/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = 2 ORDER BY created_at DESC
---
<% @blog.comments.each do |comment | %>