app/views/paintings/_gallery.html.erb

SELECT "paintings".* FROM "paintings" WHERE "paintings"."gallery_id" = 6
---
  <%for painting in @gallery.paintings.each %>