app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.blogs.any? %>
---
SELECT  1 AS one FROM "blogs" WHERE "blogs"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]