app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."created_at" DESC
---
  def index
    @blogs=Blog.all

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 ORDER BY "blogs"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = 2 ORDER BY created_at DESC
---
  def show
  @blog=Blog.find(params[:id])
  @comments=Comment.where(blog: @blog).order("created_at DESC")

INSERT INTO "blogs" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "aa11"], ["body", "11111"], ["user_id", 1], ["created_at", "2017-10-01 15:04:10.733466"], ["updated_at", "2017-10-01 15:04:10.733466"]]
---
  def create
    @blog=Blog.new(blog_params)
    @blog.user_id=current_user.id
    if @blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 ORDER BY "blogs"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
        @blog=Blog.find(params[:id])

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 ORDER BY "blogs"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
        @blog=Blog.find(params[:id])