app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "updated_at", "user_id", "blog_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "aaa"], ["created_at", "2017-10-07 09:04:52.477139"], ["updated_at", "2017-10-07 09:04:52.477139"], ["user_id", 1], ["blog_id", 2]]
---
  def create
    @comment = @blog.comments.create(params[:comment].permit(:body))

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 ORDER BY "blogs"."created_at" DESC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_blog
    @blog=Blog.find(params[:blog_id])