app/controllers/galleries_controller.rb

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "paintings".* FROM "paintings" WHERE "paintings"."gallery_id" = $1 ORDER BY "paintings"."id" ASC LIMIT $2  [["gallery_id", 4], ["LIMIT", 1]]
---
  def show
@gallery=Gallery.find(params[:id])
@paintings=Painting.where(gallery: @gallery)

INSERT INTO "galleries" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Van"], ["created_at", "2017-10-07 14:29:55.528419"], ["updated_at", "2017-10-07 14:29:55.528419"], ["user_id", 1]]
---
  def create
@gallery=Gallery.new(gallery_params)
@gallery.user_id=current_user.id
if @gallery.save