app/controllers/paintings_controller.rb

SELECT "paintings".* FROM "paintings"
---
  def index
    @paintings=Painting.all

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @painting=Painting.find(params[:id])

INSERT INTO "paintings" ("created_at", "updated_at", "image", "gallery_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2017-10-07 16:28:29.003319"], ["updated_at", "2017-10-07 16:28:29.003319"], ["image", "yuki.jpg"], ["gallery_id", 6], ["user_id", 1]]
---
  def create
    @painting =@gallery.paintings.create(params[:painting].permit(:body,:image,:remote_image_url))

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def find_album
    @gallery=Gallery.find(params[:gallery_id])

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def find_painting
    @painting=@gallery.paintings.find(params[:id])