app/controllers/users_controller.rb

  def show
    @user=User.find(params[:id])
    @blogs = @user.blogs.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."user_id" = $1 ORDER BY "blogs"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 2], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs" WHERE "blogs"."user_id" = $1  [["user_id", 2]]