app/views/galleries/show.html.erb

<div id="paintings">
  <% @gallery.paintings.each do |painting| %>
---
SELECT  "paintings".* FROM "paintings" WHERE "paintings"."gallery_id" = $1 ORDER BY "paintings"."id" ASC LIMIT $2  [["gallery_id", 4], ["LIMIT", 1]]